artillery/webServerTest2.yml
config:
  target: "http://localhost:3000"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 10
      arrivalRate: 100
  payload:
    path: "./data.csv"
    fields:
      - "productname"
      - "price"
      - "productid"
    order: "sequence"

scenarios:
  - name: "search"
    flow:
      - get:
          url: "/search/{{ productname }}/{{ price }}/{{ productid }}"
          # json:
          #   productname: "{{ productname }}" 
          #   price: "{{ price }}" 
          #   productid: "{{ productid }}"